app/controllers/food_shops_controller.rb

SELECT "food_shops".* FROM "food_shops"
---
  def index
    @food_shops = FoodShop.all

SELECT  "food_shops".* FROM "food_shops" WHERE "food_shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @food_shop = FoodShop.find(params[:id])