app/controllers/reviews_controller.rb

  def index
    @food_shop = FoodShop.find(params[:food_shop_id])
---
SELECT  "food_shops".* FROM "food_shops" WHERE "food_shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
   @review = Review.new(review_params)
   @review.user_id = current_user.id
   if @review.save
     redirect_to food_shop_reviews_path(@review.food_shop)
   else
     @food_shop = FoodnShop.find(params[:food_shop_id])
---
INSERT INTO "reviews" ("user_id", "food_shop_id", "content", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["food_shop_id", 2], ["content", "なかなか"], ["score", 3], ["created_at", "2021-01-03 06:06:13.290767"], ["updated_at", "2021-01-03 06:06:13.290767"]]
SELECT  "food_shops".* FROM "food_shops" WHERE "food_shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]