app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."food_shop_id" = ?  [["food_shop_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."food_shop_id" = ?  [["food_shop_id", 1]]
---
              <div class="average-score-display ml-3 pt-2">
                <%= @food_shop.avg_score %>点（<%= @food_shop.reviews.count %>件のレビュー）